Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
Action    = [
                          + "kms:Encrypt*",
                          + "kms:Decrypt*",
                          + "kms:ReEncrypt*",
                          + "kms:GenerateDataKey*",
                          + "kms:Describe*",
                        ]
                      + Condition = {
                          + ArnLike = {
                              + "kms:EncryptionContext:aws:logs:arn" = "arn:aws:logs:ap-northeast-2:646886795421:log-group:/aws/ecs/marketplace-scheduler-prod/*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "logs.ap-northeast-2.amazonaws.com"
                        }
                      + Resource  = "*"
                      + Sid       = "Allow CloudWatch Logs"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + rotation_period_in_days            = (known after apply)
      + tags                               = {
          + "Lifecycle"    = "production"
          + "ManagedBy"    = "terraform"
          + "Name"         = "marketplace-scheduler-logs-kms-prod"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "prod"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-scheduler"
          + "team"         = "platform-team"
        }
      + tags_all                           = {
          + "Environment"  = "prod"
          + "Lifecycle"    = "production"
          + "ManagedBy"    = "terraform"
          + "Name"         = "marketplace-scheduler-logs-kms-prod"
          + "Project"      = "marketplace"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "prod"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-scheduler"
          + "team"         = "platform-team"
        }
    }

  # module.ecs_security_group.aws_security_group.this will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "Security group for scheduler ECS tasks"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "marketplace-scheduler-sg-prod"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "Security group for scheduler ECS tasks"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "marketplace-scheduler-sg-prod"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "marketplace"
          + "Service"     = "marketplace-scheduler"
          + "Type"        = "custom"
        }
      + tags_all               = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "Security group for scheduler ECS tasks"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "marketplace-scheduler-sg-prod"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "marketplace"
          + "Service"     = "marketplace-scheduler"
          + "Type"        = "custom"
        }
      + vpc_id                 = (sensitive value)
    }

  # module.ecs_security_group.aws_vpc_security_group_egress_rule.default[0] will be created
  + resource "aws_vpc_security_group_egress_rule" "default" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "Allow all outbound traffic"
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "marketplace-scheduler-sg-prod-default-egress"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "marketplace"
          + "Service"     = "marketplace-scheduler"
        }
      + tags_all               = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "marketplace-scheduler-sg-prod-default-egress"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "marketplace"
          + "Service"     = "marketplace-scheduler"
        }
    }

  # module.ecs_security_group.aws_vpc_security_group_ingress_rule.custom["0"] will be created
  + resource "aws_vpc_security_group_ingress_rule" "custom" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "10.0.0.0/16"
      + description            = "VPC internal traffic only (Health check, Service Discovery)"
      + from_port              = 8081
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "marketplace-scheduler-sg-prod-custom-ingress-0"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "marketplace"
          + "Service"     = "marketplace-scheduler"
        }
      + tags_all               = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "marketplace-scheduler-sg-prod-custom-ingress-0"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "marketplace"
          + "Service"     = "marketplace-scheduler"
        }
      + to_port                = 8081
    }

  # module.ecs_service.aws_service_discovery_service.this[0] will be created
  + resource "aws_service_discovery_service" "this" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "marketplace-scheduler-prod"
      + namespace_id  = (known after apply)
      + tags          = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "Cloud Map service for marketplace-scheduler-prod"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "marketplace-scheduler-prod-service-discovery"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "marketplace"
          + "Service"     = "marketplace-scheduler"
        }
      + tags_all      = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "Cloud Map service for marketplace-scheduler-prod"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "marketplace-scheduler-prod-service-discovery"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "marketplace"
          + "Service"     = "marketplace-scheduler"
        }
      + type          = (known after apply)

      + dns_config {
          + namespace_id   = (sensitive value)
          + routing_policy = "MULTIVALUE"

          + dns_records {
              + ttl  = 10
              + type = "A"
            }
        }

      + health_check_custom_config {
          + failure_threshold = 1
        }
    }

  # module.scheduler_logs.aws_cloudwatch_log_group.this will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + kms_key_id        = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/ecs/marketplace-scheduler-prod/application"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags              = (known after apply)
      + tags_all          = (known after apply)
    }

  # module.scheduler_task_execution_role.aws_iam_role.this will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "IAM role for marketplace-scheduler-execution-role-prod"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "marketplace-scheduler-execution-role-prod"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Component"   = "iam-role"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "marketplace-scheduler-execution-role-prod"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "marketplace"
          + "Service"     = "marketplace-scheduler"
        }
      + tags_all              = {
          + "Component"   = "iam-role"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "marketplace-scheduler-execution-role-prod"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "marketplace"
          + "Service"     = "marketplace-scheduler"
        }
      + unique_id             = (known after apply)
    }

  # module.scheduler_task_execution_role.aws_iam_role_policy.custom["ssm-access"] will be created
  + resource "aws_iam_role_policy" "custom" {
      + id          = (known after apply)
      + name        = "marketplace-scheduler-execution-role-prod-ssm-access"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # module.scheduler_task_execution_role.aws_iam_role_policy_attachment.aws-managed["arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "aws-managed" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = "marketplace-scheduler-execution-role-prod"
    }

  # module.scheduler_task_role.aws_iam_role.this will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "IAM role for marketplace-scheduler-task-role-prod"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "marketplace-scheduler-task-role-prod"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Component"   = "iam-role"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "marketplace-scheduler-task-role-prod"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "marketplace"
          + "Service"     = "marketplace-scheduler"
        }
      + tags_all              = {
          + "Component"   = "iam-role"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "marketplace-scheduler-task-role-prod"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "marketplace"
          + "Service"     = "marketplace-scheduler"
        }
      + unique_id             = (known after apply)
    }

  # module.scheduler_task_role.aws_iam_role_policy.custom["adot-amp-access"] will be created
  + resource "aws_iam_role_policy" "custom" {
      + id          = (known after apply)
      + name        = "marketplace-scheduler-task-role-prod-adot-amp-access"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "aps:RemoteWrite",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:aps:ap-northeast-2:*:workspace/*"
                      + Sid      = "AMPRemoteWrite"
                    },
                  + {
                      + Action   = [
                          + "xray:PutTraceSegments",
                          + "xray:PutTelemetryRecords",
                          + "xray:GetSamplingRules",
                          + "xray:GetSamplingTargets",
                          + "xray:GetSamplingStatisticSummaries",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "XRayTracing"
                    },
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                          + "logs:DescribeLogStreams",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:logs:ap-northeast-2:646886795421:log-group:/ecs/marketplace/otel:*",
                          + "arn:aws:logs:ap-northeast-2:646886795421:log-group:/ecs/marketplace/otel-collector:*",
                        ]
                      + Sid      = "CloudWatchLogsAccess"
                    },
                  + {
                      + Action    = [
                          + "cloudwatch:PutMetricData",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "cloudwatch:namespace" = "MarketPlace"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                      + Sid       = "CloudWatchMetricsAccess"
                    },
                  + {
                      + Action   = [
                          + "s3:GetObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::prod-connectly/*"
                      + Sid      = "S3ConfigAccess"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # module.scheduler_task_role.aws_iam_role_policy.custom["ses-access"] will be created
  + resource "aws_iam_role_policy" "custom" {
      + id          = (known after apply)
      + name        = "marketplace-scheduler-task-role-prod-ses-access"
      + name_prefix = (known after apply)
      + policy      = (sensitive value)
      + role        = (known after apply)
    }

  # module.scheduler_task_role.aws_iam_role_policy.custom["sqs-access"] will be created
  + resource "aws_iam_role_policy" "custom" {
      + id          = (known after apply)
      + name        = "marketplace-scheduler-task-role-prod-sqs-access"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "sqs:SendMessage",
                          + "sqs:GetQueueUrl",
                          + "sqs:GetQueueAttributes",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:sqs:ap-northeast-2:*:marketplace-*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

Plan: 14 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + service_discovery_dns = "marketplace-scheduler.connectly.local"
╷
│ Error: reading ECR Repository (marketplace-scheduler-prod): couldn't find resource
│ 
│   with data.aws_ecr_repository.scheduler,
│   on main.tf line 32, in data "aws_ecr_repository" "scheduler":
│   32: data "aws_ecr_repository" "scheduler" {
│ 
╵
╷
│ Error: reading ECS Cluster (marketplace-cluster-prod): empty result
│ 
│   with data.aws_ecs_cluster.main,
│   on main.tf line 39, in data "aws_ecs_cluster" "main":
│   39: data "aws_ecs_cluster" "main" {
│ 
╵
╷
│ Error: reading Secrets Manager Secret (marketplace/rds/credentials): couldn't find resource
│ 
│   with data.aws_secretsmanager_secret.rds,
│   on provider.tf line 107, in data "aws_secretsmanager_secret" "rds":
│  107: data "aws_secretsmanager_secret" "rds" {
│ 
╵

```
</details>

---
### 6. project: `marketplace-ecr-stage` dir: `terraform/environments/stage/ecr` workspace: `default`
<details><summary>Show Output</summary>

```diff
module.ecr_web_api.data.aws_caller_identity.current: Reading...
module.ecr_scheduler.data.aws_caller_identity.current: Reading...
module.ecr_web_api.data.aws_caller_identity.current: Read complete after 0s [id=646886795421]
module.ecr_scheduler.data.aws_caller_identity.current: Read complete after 0s [id=646886795421]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.ecr_scheduler.aws_ecr_lifecycle_policy.this[0] will be created
+ resource "aws_ecr_lifecycle_policy" "this" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 15 tagged images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber   = 15
                          + countType     = "imageCountMoreThan"
                          + tagPrefixList = [
                              + "v",
                              + "stage",
                              + "latest",
                            ]
                          + tagStatus     = "tagged"
                        }
                    },
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Delete untagged images after 3 days"
                      + rulePriority = 2
                      + selection    = {
                          + countNumber = 3
                          + countType   = "sinceImagePushed"
                          + countUnit   = "days"
                          + tagStatus   = "untagged"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "marketplace-scheduler-stage"
    }

  # module.ecr_scheduler.aws_ecr_repository.this will be created
+ resource "aws_ecr_repository" "this" {
      + arn                  = (known after apply)
      + force_delete         = true
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "marketplace-scheduler-stage"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "Component"   = "container-registry"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "staging"
          + "Lifecycle"   = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "ecr-marketplace-scheduler-stage"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "marketplace"
          + "Service"     = "marketplace-scheduler"
        }
      + tags_all             = {
          + "Component"   = "container-registry"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "staging"
          + "Lifecycle"   = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "ecr-marketplace-scheduler-stage"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "marketplace"
          + "Service"     = "marketplace-scheduler"
        }

      + encryption_configuration {
          + encryption_type = "KMS"
          + kms_key         = "arn:aws:kms:ap-northeast-2:646886795421:key/086b1677-614f-46ba-863e-23c215fb5010"
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # module.ecr_scheduler.aws_ecr_repository_policy.default[0] will be created
+ resource "aws_ecr_repository_policy" "default" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:BatchGetImage",
                          + "ecr:BatchCheckLayerAvailability",
                          + "ecr:PutImage",
                          + "ecr:InitiateLayerUpload",
                          + "ecr:UploadLayerPart",
                          + "ecr:CompleteLayerUpload",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::646886795421:root"
                        }
                      + Sid       = "AllowPushPull"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + registry_id = (known after apply)
      + repository  = "marketplace-scheduler-stage"
    }

  # module.ecr_scheduler.aws_ssm_parameter.repository-url[0] will be created
+ resource "aws_ssm_parameter" "repository-url" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "ECR repository URL for marketplace-scheduler-stage"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/shared/ecr/marketplace-scheduler-stage-repository-url"
      + tags           = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "staging"
          + "Lifecycle"   = "staging"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "marketplace"
          + "Service"     = "marketplace-scheduler"
        }
      + tags_all       = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "staging"
          + "Lifecycle"   = "staging"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "marketplace"
          + "Service"     = "marketplace-scheduler"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.ecr_web_api.aws_ecr_lifecycle_policy.this[0] will be created
+ resource "aws_ecr_lifecycle_policy" "this" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 15 tagged images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber   = 15
                          + countType     = "imageCountMoreThan"
                          + tagPrefixList = [
                              + "v",
                              + "stage",
                              + "latest",
                            ]
                          + tagStatus     = "tagged"
                        }
                    },
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Delete untagged images after 3 days"
                      + rulePriority = 2
                      + selection    = {
                          + countNumber = 3
                          + countType   = "sinceImagePushed"
                          + countUnit   = "days"
                          + tagStatus   = "untagged"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "marketplace-web-api-stage"
    }

  # module.ecr_web_api.aws_ecr_repository.this will be created
+ resource "aws_ecr_repository" "this" {
      + arn                  = (known after apply)
      + force_delete         = true
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "marketplace-web-api-stage"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "Component"   = "container-registry"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "staging"
          + "Lifecycle"   = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "ecr-marketplace-web-api-stage"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "marketplace"
          + "Service"     = "marketplace-web-api"
        }
      + tags_all             = {
          + "Component"   = "container-registry"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "staging"
          + "Lifecycle"   = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "ecr-marketplace-web-api-stage"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "marketplace"
          + "Service"     = "marketplace-web-api"
        }

      + encryption_configuration {
          + encryption_type = "KMS"
          + kms_key         = "arn:aws:kms:ap-northeast-2:646886795421:key/086b1677-614f-46ba-863e-23c215fb5010"
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # module.ecr_web_api.aws_ecr_repository_policy.default[0] will be created
+ resource "aws_ecr_repository_policy" "default" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:BatchGetImage",
                          + "ecr:BatchCheckLayerAvailability",
                          + "ecr:PutImage",
                          + "ecr:InitiateLayerUpload",
                          + "ecr:UploadLayerPart",
                          + "ecr:CompleteLayerUpload",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::646886795421:root"
                        }
                      + Sid       = "AllowPushPull"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + registry_id = (known after apply)
      + repository  = "marketplace-web-api-stage"
    }

  # module.ecr_web_api.aws_ssm_parameter.repository-url[0] will be created
+ resource "aws_ssm_parameter" "repository-url" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "ECR repository URL for marketplace-web-api-stage"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/shared/ecr/marketplace-web-api-stage-repository-url"
      + tags           = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "staging"
          + "Lifecycle"   = "staging"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "marketplace"
          + "Service"     = "marketplace-web-api"
        }
      + tags_all       = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "staging"
          + "Lifecycle"   = "staging"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "marketplace"
          + "Service"     = "marketplace-web-api"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

Plan: 8 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ scheduler_repository_arn = (known after apply)
+ scheduler_repository_url = (known after apply)
+ web_api_repository_arn   = (known after apply)
+ web_api_repository_url   = (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p marketplace-ecr-stage
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252FMarketPlace%252Fterraform%252Fenvironments%252Fstage%252Fecr%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p marketplace-ecr-stage
  ```
Plan: 8 to add, 0 to change, 0 to destroy.

---
### 7. project: `marketplace-ecs-cluster-stage` dir: `terraform/environments/stage/ecs-cluster` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_ecs_cluster.main will be created
+ resource "aws_ecs_cluster" "main" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "marketplace-cluster-stage"
      + tags     = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "stage"
          + "Lifecycle"   = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "marketplace-cluster-stage"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "marketplace"
          + "Service"     = "marketplace-ecs-cluster"
        }
      + tags_all = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "stage"
          + "Lifecycle"   = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "marketplace-cluster-stage"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "marketplace"
          + "Service"     = "marketplace-ecs-cluster"
        }

      + setting {
          + name  = "containerInsights"
          + value = "enabled"
        }
    }

  # aws_ecs_cluster_capacity_providers.main will be created
+ resource "aws_ecs_cluster_capacity_providers" "main" {
      + capacity_providers = [
          + "FARGATE",
          + "FARGATE_SPOT",
        ]
      + cluster_name       = "marketplace-cluster-stage"
      + id                 = (known after apply)

      + default_capacity_provider_strategy {
          + base              = 1
          + capacity_provider = "FARGATE"
          + weight            = 100
        }
    }

  # aws_ssm_parameter.cluster_arn will be created
+ resource "aws_ssm_parameter" "cluster_arn" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "MarketPlace ECS cluster ARN (stage)"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/marketplace/ecs-stage/cluster-arn"
      + tags           = {
          + "Environment" = "stage"
          + "Name"        = "marketplace-ecs-cluster-arn-stage"
        }
      + tags_all       = {
          + "Environment" = "stage"
          + "ManagedBy"   = "terraform"
          + "Name"        = "marketplace-ecs-cluster-arn-stage"
          + "Project"     = "marketplace"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.cluster_name will be created
+ resource "aws_ssm_parameter" "cluster_name" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "MarketPlace ECS cluster name (stage)"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/marketplace/ecs-stage/cluster-name"
      + tags           = {
          + "Environment" = "stage"
          + "Name"        = "marketplace-ecs-cluster-name-stage"
        }
      + tags_all       = {
          + "Environment" = "stage"
          + "ManagedBy"   = "terraform"
          + "Name"        = "marketplace-ecs-cluster-name-stage"
          + "Project"     = "marketplace"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ cluster_arn  = (known after apply)
+ cluster_id   = (known after apply)
+ cluster_name = "marketplace-cluster-stage"
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p marketplace-ecs-cluster-stage
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252FMarketPlace%252Fterraform%252Fenvironments%252Fstage%252Fecs-cluster%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p marketplace-ecs-cluster-stage
  ```
Plan: 4 to add, 0 to change, 0 to destroy.

---
### 8. project: `marketplace-ecs-web-api-stage` dir: `terraform/environments/stage/ecs-web-api` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running "/home/atlantis/.atlantis/bin/terraform1.8.1 plan -input=false -refresh -out \"/home/atlantis/.atlantis/repos/ryu-qqq/MarketPlace/1/default/terraform/environments/stage/ecs-web-api/marketplace-ecs-web-api-stage-default.tfplan\"" in "/home/atlantis/.atlantis/repos/ryu-qqq/MarketPlace/1/default/terraform/environments/stage/ecs-web-api": exit status 1
data.aws_ssm_parameter.service_token_secret: Reading...
data.aws_ssm_parameter.amp_workspace_arn: Reading...
data.aws_ecr_repository.web_api: Reading...
module.web_api_task_execution_role.data.aws_region.current: Reading...
data.aws_caller_identity.current: Reading...
data.aws_ssm_parameter.vpc_id: Reading...
data.aws_ssm_parameter.amp_remote_write_url: Reading...
data.aws_ssm_parameter.service_discovery_namespace_id: Reading...
data.aws_ecs_cluster.main: Reading...
data.aws_secretsmanager_secret.rds: Reading...
module.web_api_task_execution_role.data.aws_region.current: Read complete after 0s [id=ap-northeast-2]
data.aws_ssm_parameter.private_subnets: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=646886795421]
module.web_api_task_execution_role.data.aws_caller_identity.current: Reading...
module.web_api_task_execution_role.data.aws_caller_identity.current: Read complete after 0s [id=646886795421]
module.web_api_task_role.data.aws_region.current: Reading...
module.web_api_task_role.data.aws_region.current: Read complete after 0s [id=ap-northeast-2]
data.aws_ssm_parameter.amp_workspace_arn: Read complete after 0s [id=/shared/monitoring/amp-workspace-arn]
data.aws_ssm_parameter.ses_access_key_id: Reading...
data.aws_ssm_parameter.amp_remote_write_url: Read complete after 0s [id=/shared/monitoring/amp-remote-write-url]
module.web_api_task_role.data.aws_caller_identity.current: Reading...
data.aws_ssm_parameter.service_discovery_namespace_id: Read complete after 0s [id=/shared/service-discovery/namespace-id]
data.aws_ssm_parameter.private_subnets: Read complete after 0s [id=/shared/network/private-subnets]
module.ecs_service.data.aws_caller_identity.current: Reading...
data.aws_secretsmanager_secret.rds: Read complete after 0s [id=arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:setof-commerce/rds/staging-credentials-hhmFwn]
module.ecs_service.data.aws_region.current: Reading...
data.aws_ssm_parameter.ses_secret_access_key: Reading...
module.web_api_task_role.data.aws_caller_identity.current: Read complete after 0s [id=646886795421]
data.aws_ssm_parameter.service_token_secret: Read complete after 0s [id=/shared/security/service-token-secret]
module.ecs_service.data.aws_region.current: Read complete after 0s [id=ap-northeast-2]
module.ecs_service.data.aws_caller_identity.current: Read complete after 0s [id=646886795421]
data.aws_ssm_parameter.vpc_id: Read complete after 0s [id=/shared/network/vpc-id]
data.aws_secretsmanager_secret_version.rds: Reading...
data.aws_ssm_parameter.ses_access_key_id: Read complete after 0s [id=/marketplace/ses/access-key-id]
data.aws_vpc.main: Reading...
data.aws_ssm_parameter.ses_secret_access_key: Read complete after 0s [id=/marketplace/ses/secret-access-key]
data.aws_secretsmanager_secret_version.rds: Read complete after 0s [id=arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:setof-commerce/rds/staging-credentials-hhmFwn|AWSCURRENT]
data.aws_vpc.main: Read complete after 1s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # aws_kms_alias.logs will be created
  + resource "aws_kms_alias" "logs" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/marketplace-web-api-logs-stage"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # aws_kms_key.logs will be created
  + resource "aws_kms_key" "logs" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 30
      + description                        = "KMS key for MarketPlace web-api CloudWatch logs encryption (stage)"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::646886795421:root"
                        }
                      + Resource  = "*"
                      + Sid       = "Enable IAM User Permissions"
                    },
                  + {
                      + Action    = [
                          + "kms:Encrypt*",
                          + "kms:Decrypt*",
                          + "kms:ReEncrypt*",
                          + "kms:GenerateDataKey*",
                          + "kms:Describe*",
                        ]
                      + Condition = {
                          + ArnLike = {
                              + "kms:EncryptionContext:aws:logs:arn" = "arn:aws:logs:ap-northeast-2:646886795421:log-group:/aws/ecs/marketplace-web-api-stage/*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "logs.ap-northeast-2.amazonaws.com"
                        }
                      + Resource  = "*"
                      + Sid       = "Allow CloudWatch Logs"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + rotation_period_in_days            = (known after apply)
      + tags                               = {
          + "Lifecycle"    = "staging"
          + "ManagedBy"    = "terraform"
          + "Name"         = "marketplace-web-api-logs-kms-stage"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "stage"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-web-api"
          + "team"         = "platform-team"
        }
      + tags_all                           = {
          + "Environment"  = "stage"
          + "Lifecycle"    = "staging"
          + "ManagedBy"    = "terraform"
          + "Name"         = "marketplace-web-api-logs-kms-stage"
          + "Project"      = "marketplace"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "stage"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-web-api"
          + "team"         = "platform-team"
        }
    }

  # module.ecs_security_group.aws_security_group.this will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "Security group for web-api ECS tasks (stage)"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "marketplace-web-api-sg-stage"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "Security group for web-api ECS tasks (stage)"
          + "Environment" = "stage"
          + "Lifecycle"   = "temporary"
          + "ManagedBy"   = "terraform"
          + "Name"        = "marketplace-web-api-sg-stage"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "marketplace"
          + "Service"     = "marketplace-web-api"
          + "Type"        = "custom"
        }
      + tags_all               = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "Security group for web-api ECS tasks (stage)"
          + "Environment" = "stage"
          + "Lifecycle"   = "temporary"
          + "ManagedBy"   = "terraform"
          + "Name"        = "marketplace-web-api-sg-stage"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "marketplace"
          + "Service"     = "marketplace-web-api"
          + "Type"        = "custom"
        }
      + vpc_id                 = (sensitive value)
    }

  # module.ecs_security_group.aws_vpc_security_group_egress_rule.default[0] will be created
  + resource "aws_vpc_security_group_egress_rule" "default" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "Allow all outbound traffic"
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "stage"
          + "Lifecycle"   = "temporary"
          + "ManagedBy"   = "terraform"
          + "Name"        = "marketplace-web-api-sg-stage-default-egress"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "marketplace"
          + "Service"     = "marketplace-web-api"
        }
      + tags_all               = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "stage"
          + "Lifecycle"   = "temporary"
          + "ManagedBy"   = "terraform"
          + "Name"        = "marketplace-web-api-sg-stage-default-egress"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "marketplace"
          + "Service"     = "marketplace-web-api"
        }
    }

  # module.ecs_security_group.aws_vpc_security_group_ingress_rule.custom["0"] will be created
  + resource "aws_vpc_security_group_ingress_rule" "custom" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "10.0.0.0/16"
      + description            = "VPC internal traffic only (API Gateway, Service Discovery)"
      + from_port              = 8080
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "stage"
          + "Lifecycle"   = "temporary"
          + "ManagedBy"   = "terraform"
          + "Name"        = "marketplace-web-api-sg-stage-custom-ingress-0"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "marketplace"
          + "Service"     = "marketplace-web-api"
        }
      + tags_all               = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "stage"
          + "Lifecycle"   = "temporary"
          + "ManagedBy"   = "terraform"
          + "Name"        = "marketplace-web-api-sg-stage-custom-ingress-0"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "marketplace"
          + "Service"     = "marketplace-web-api"
        }
      + to_port                = 8080
    }

  # module.ecs_service.aws_service_discovery_service.this[0] will be created
  + resource "aws_service_discovery_service" "this" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "marketplace-api-stage"
      + namespace_id  = (known after apply)
      + tags          = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "Cloud Map service for marketplace-api-stage"
          + "Environment" = "stage"
          + "Lifecycle"   = "temporary"
          + "ManagedBy"   = "terraform"
          + "Name"        = "marketplace-api-stage-service-discovery"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "marketplace"
          + "Service"     = "marketplace-web-api"
        }
      + tags_all      = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "Cloud Map service for marketplace-api-stage"
          + "Environment" = "stage"
          + "Lifecycle"   = "temporary"
          + "ManagedBy"   = "terraform"
          + "Name"        = "marketplace-api-stage-service-discovery"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "marketplace"
          + "Service"     = "marketplace-web-api"
        }
      + type          = (known after apply)

      + dns_config {
          + namespace_id   = (sensitive value)
          + routing_policy = "MULTIVALUE"

          + dns_records {
              + ttl  = 10
              + type = "A"
            }
        }

      + health_check_custom_config {
          + failure_threshold = 1
        }
    }

  # module.web_api_logs.aws_cloudwatch_log_group.this will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + kms_key_id        = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/ecs/marketplace-web-api-stage/application"
      + name_prefix       = (known after apply)
      + retention_in_days = 14
      + skip_destroy      = false
      + tags              = (known after apply)
      + tags_all          = (known after apply)
    }

  # module.web_api_task_execution_role.aws_iam_role.this will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "IAM role for marketplace-web-api-execution-role-stage"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "marketplace-web-api-execution-role-stage"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Component"   = "iam-role"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "stage"
          + "Lifecycle"   = "temporary"
          + "ManagedBy"   = "terraform"
          + "Name"        = "marketplace-web-api-execution-role-stage"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "marketplace"
          + "Service"     = "marketplace-web-api"
        }
      + tags_all              = {
          + "Component"   = "iam-role"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "stage"
          + "Lifecycle"   = "temporary"
          + "ManagedBy"   = "terraform"
          + "Name"        = "marketplace-web-api-execution-role-stage"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "marketplace"
          + "Service"     = "marketplace-web-api"
        }
      + unique_id             = (known after apply)
    }

  # module.web_api_task_execution_role.aws_iam_role_policy.custom["ssm-access"] will be created
  + resource "aws_iam_role_policy" "custom" {
      + id          = (known after apply)
      + name        = "marketplace-web-api-execution-role-stage-ssm-access"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # module.web_api_task_execution_role.aws_iam_role_policy.secrets-manager[0] will be created
  + resource "aws_iam_role_policy" "secrets-manager" {
      + id          = (known after apply)
      + name        = "marketplace-web-api-execution-role-stage-secrets-manager"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "secretsmanager:GetSecretValue",
                          + "secretsmanager:DescribeSecret",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:setof-commerce/rds/staging-credentials-hhmFwn",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # module.web_api_task_execution_role.aws_iam_role_policy_attachment.aws-managed["arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "aws-managed" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = "marketplace-web-api-execution-role-stage"
    }

  # module.web_api_task_role.aws_iam_role.this will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "IAM role for marketplace-web-api-task-role-stage"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "marketplace-web-api-task-role-stage"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Component"   = "iam-role"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "stage"
          + "Lifecycle"   = "temporary"
          + "ManagedBy"   = "terraform"
          + "Name"        = "marketplace-web-api-task-role-stage"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "marketplace"
          + "Service"     = "marketplace-web-api"
        }
      + tags_all              = {
          + "Component"   = "iam-role"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "stage"
          + "Lifecycle"   = "temporary"
          + "ManagedBy"   = "terraform"
          + "Name"        = "marketplace-web-api-task-role-stage"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "marketplace"
          + "Service"     = "marketplace-web-api"
        }
      + unique_id             = (known after apply)
    }

  # module.web_api_task_role.aws_iam_role_policy.custom["adot-amp-access"] will be created
  + resource "aws_iam_role_policy" "custom" {
      + id          = (known after apply)
      + name        = "marketplace-web-api-task-role-stage-adot-amp-access"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "aps:RemoteWrite",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:aps:ap-northeast-2:*:workspace/*"
                      + Sid      = "AMPRemoteWrite"
                    },
                  + {
                      + Action   = [
                          + "xray:PutTraceSegments",
                          + "xray:PutTelemetryRecords",
                          + "xray:GetSamplingRules",
                          + "xray:GetSamplingTargets",
                          + "xray:GetSamplingStatisticSummaries",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "XRayTracing"
                    },
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                          + "logs:DescribeLogStreams",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:logs:ap-northeast-2:646886795421:log-group:/ecs/marketplace/otel:*",
                          + "arn:aws:logs:ap-northeast-2:646886795421:log-group:/ecs/marketplace/otel-collector:*",
                        ]
                      + Sid      = "CloudWatchLogsAccess"
                    },
                  + {
                      + Action    = [
                          + "cloudwatch:PutMetricData",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "cloudwatch:namespace" = "MarketPlace"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                      + Sid       = "CloudWatchMetricsAccess"
                    },
                  + {
                      + Action   = [
                          + "s3:GetObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::prod-connectly/*"
                      + Sid      = "S3ConfigAccess"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # module.web_api_task_role.aws_iam_role_policy.custom["ses-access"] will be created
  + resource "aws_iam_role_policy" "custom" {
      + id          = (known after apply)
      + name        = "marketplace-web-api-task-role-stage-ses-access"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ses:SendEmail",
                          + "ses:SendRawEmail",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

Plan: 14 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + service_discovery_dns = "marketplace-api-stage.connectly.local"
╷
│ Error: reading ECR Repository (marketplace-web-api-stage): couldn't find resource
│ 
│   with data.aws_ecr_repository.web_api,
│   on main.tf line 28, in data "aws_ecr_repository" "web_api":
│   28: data "aws_ecr_repository" "web_api" {
│ 
╵
╷
│ Error: reading ECS Cluster (marketplace-cluster-stage): empty result
│ 
│   with data.aws_ecs_cluster.main,
│   on main.tf line 35, in data "aws_ecs_cluster" "main":
│   35: data "aws_ecs_cluster" "main" {
│ 
╵

```
</details>

---
### 9. project: `marketplace-ecs-scheduler-stage` dir: `terraform/environments/stage/ecs-scheduler` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running "/home/atlantis/.atlantis/bin/terraform1.8.1 plan -input=false -refresh -out \"/home/atlantis/.atlantis/repos/ryu-qqq/MarketPlace/1/default/terraform/environments/stage/ecs-scheduler/marketplace-ecs-scheduler-stage-default.tfplan\"" in "/home/atlantis/.atlantis/repos/ryu-qqq/MarketPlace/1/default/terraform/environments/stage/ecs-scheduler": exit status 1
data.aws_ssm_parameter.ses_sender_email: Reading...
data.aws_secretsmanager_secret.rds: Reading...
data.aws_ssm_parameter.vpc_id: Reading...
data.aws_ecs_cluster.main: Reading...
module.ecs_service.data.aws_caller_identity.current: Reading...
module.scheduler_task_role.data.aws_region.current: Reading...
module.scheduler_task_role.data.aws_caller_identity.current: Reading...
module.scheduler_task_execution_role.data.aws_caller_identity.current: Reading...
data.aws_ecr_repository.scheduler: Reading...
data.aws_caller_identity.current: Reading...
module.scheduler_task_role.data.aws_region.current: Read complete after 0s [id=ap-northeast-2]
module.ecs_service.data.aws_caller_identity.current: Read complete after 0s [id=646886795421]
data.aws_ssm_parameter.amp_workspace_arn: Reading...
data.aws_ssm_parameter.service_discovery_namespace_id: Reading...
module.scheduler_task_role.data.aws_caller_identity.current: Read complete after 0s [id=646886795421]
module.scheduler_task_execution_role.data.aws_caller_identity.current: Read complete after 0s [id=646886795421]
module.scheduler_task_execution_role.data.aws_region.current: Reading...
data.aws_ssm_parameter.sentry_dsn: Reading...
module.scheduler_task_execution_role.data.aws_region.current: Read complete after 0s [id=ap-northeast-2]
data.aws_caller_identity.current: Read complete after 0s [id=646886795421]
data.aws_ssm_parameter.private_subnets: Reading...
data.aws_ssm_parameter.amp_remote_write_url: Reading...
data.aws_secretsmanager_secret.rds: Read complete after 0s [id=arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:setof-commerce/rds/staging-credentials-hhmFwn]
data.aws_ssm_parameter.ses_sender_email: Read complete after 0s [id=/marketplace/ses/sender-email]
data.aws_secretsmanager_secret_version.rds: Reading...
module.ecs_service.data.aws_region.current: Reading...
data.aws_ssm_parameter.service_discovery_namespace_id: Read complete after 0s [id=/shared/service-discovery/namespace-id]
data.aws_ssm_parameter.amp_workspace_arn: Read complete after 0s [id=/shared/monitoring/amp-workspace-arn]
module.ecs_service.data.aws_region.current: Read complete after 0s [id=ap-northeast-2]
data.aws_ssm_parameter.vpc_id: Read complete after 0
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.